In [1]:
import numpy as np
import pandas as pd

In [2]:
#Create a DataFrame from dictionary.

#Read a CSV file into DataFrame.

#Display first 5 and last 5 records.

#Find column names and data types.

#Select one column and multiple columns.

#Add a new column to DataFrame.

#Rename column names.

In [3]:
#Create a DataFrame from dictionary.

data = pd.DataFrame({"Name":["Dipali","soham","sangita","shankar"],
                    "Address" :["pune","mumbai","pune","mumbai"],
                    "Age":[20,17,40,50],
                    "Gender":["f","m","f","m"]})
data

      Name Address  Age Gender
0   Dipali    pune   20      f
1    soham  mumbai   17      m
2  sangita    pune   40      f
3  shankar  mumbai   50      m

In [4]:
#Read a CSV file into DataFrame.
data1 = pd.read_csv("DATAFRAMES/Fortune_10.csv")

In [5]:
#Display first 5 and last 5 records.
data1.head()

,ID,Date,Name,Companies,Inception,Revenue,Expenses,Profit,Growth
0,1,Yes,Lamtone,IT Service,2009,"$11,757,018","6,482,465 Dollars",5274553,30%
1,2,Yes,Stripfind,Financial Services,2010,"$12,329,371","916,455 Dollars",11412916,20%
2,3,No,Canecorporation,Health,2012,"$10,597,009","7,591,189 Dollars",3005820,7%
3,4,Yes,Mattouch,IT Service,2013,"$14,026,934","7,429,377 Dollars",6597557,26%
4,5,No,Techdrill,Health,2009,"$10,573,990","7,435,363 Dollars",3138627,8%

In [6]:
data1.tail()

,ID,Date,Name,Companies,Inception,Revenue,Expenses,Profit,Growth
5,6,Yes,Techline,Health,2006,"$13,898,119","5,470,303 Dollars",8427816,23%
6,7,Yes,Cityace,Health,2010,"$9,254,614","6,249,498 Dollars",3005116,6%
7,8,No,Kayelectronics,Health,2009,"$9,451,943","3,878,113 Dollars",5573830,4%
8,9,Yes,Ganzlax,IT Service,2011,"$14,001,180","3,878,153 Dollars",11901180,18%
9,10,Yes,Transtraxlax,Government Services,2011,"$11,088,336","5,635,276 Dollars",5453060,7%

In [10]:
#Find column names and data types.
data1.coulmns

AttributeError: 'DataFrame' object has no attribute 'coulmns'